app/views/users/show.html.erb

		#???コントローラーから受け取った@userはuserとして代入されるという意味わざわざuserに変換する必要あるのかなと思う
	　@user = User.find(params[:id])-->
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]