app/controllers/book_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    #createアクションが実行され、送られてきた、bookのIDを受け取っている
    comment = current_user.book_comments.new(comment_params)
    #ログインしているユーザーのbook_commmentsの新しいテーブルが発行される。???ここでbook_commentテーブルのuser.idが作られているのか？???current_userとはここでは何を表しているのか
    # current_userはcomments.user_idを入力している
    # 新しくcommentを受け取ったcomments
    comment.book_id = book.id
    #新しく作られるbook_commentテーブルのbook_commentのbook_idは受け取ったbook_idと同じにするという式。book_commentテーブルのbook_comment_idは自動で作られるが、book_commentテーブルのbook_commentのbook_idはこのような式にして作らなければいけない。ああややこしい。
    #？？？でもその場合book_commentテーブルのuser.idはどうなるのか？ログインしているユーザーのIDが自動的に作られるのか？
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["book_id", 1], ["comment", "fdddd"], ["created_at", "2020-06-05 04:08:42.290494"], ["updated_at", "2020-06-05 04:08:42.290494"]]

  def destroy
    comment = BookComment.find(params[:id])
    #この場合booksのshowでbook_book_comment_pathというパス名でDELETEアクションが実行されている。それを実行すると、rails routesではbook_comments#destroyが実行されるとなってる為、回ってきたIDをここで受け取っている。
    comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 4]]

   def baria_user
    comment = BookComment.find(params[:id])
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]