app/controllers/books_controller.rb

  def index
		@book = Book.new
		#前述、新しいBookテーブルの作成
  	@books = Book.all
---
SELECT "books".* FROM "books"

  def create
	  @book = Book.new(book_params)
		#book_paramsを引数として、（下記で定義されている）新しいBookテーブルの作成している
	  @book.user_id = current_user.id
		#新しく作られるbookテーブルのuser_idはログインしているuserと同じものにするという式。bookテーブルのbook.idは自動で作られるが、bookテーブルのuser_idはこのような式にして作らなければいけない。
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to books_path, notice: "successfully created book!"
			#保存された場合の移動先を指定。
			#でもredirect_toの指定先が＠bookはどこを指してるのか。→新しく@book = Book.new(book_params)で作られたidである。具体的にはbook/idとなる。
			#???しかしidも指定していないのにどうしてそのURLに飛ぶのか
			#どこに飛ばすかによる。サンプル。
  	else
  		@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ddddfd"], ["body", "fffff"], ["user_id", 3], ["created_at", "2020-06-07 06:19:04.668557"], ["updated_at", "2020-06-07 06:19:04.668557"]]
SELECT "books".* FROM "books"

  def update
  	@book = Book.find(params[:id])
		#送られてきたidを検索してその全ての情報を@bookに格納している。
  	if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aaaa"], ["body", "aaaaaa"], ["updated_at", "2020-06-05 01:24:30.421774"], ["id", 5]]

  def destroy
  	@book = Book.find(params[:id])
		#送られてきたidを検索してその全ての情報を@bookに格納している。
  	@book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 7]]

  def baria_user
	unless Book.find(params[:id]).user.id.to_i == current_user.id
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]