app/controllers/favorites_controller.rb

  def create
    book = Book.find(params[:book_id])
    #createアクションが実行され、送られてきた、bookのIDを受け取っている
    favorite = current_user.favorites.new(book_id: book.id)
    #ログインしているユーザーのfavoritesの新しいテーブルが発行される。???ここでfavoritesテーブルのuser.idが作られているのか？???current_userとはここでは何を表しているのか。???book_id: book.idとは何か。
    favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 4], ["user_id", 3], ["created_at", "2020-06-05 04:21:18.251543"], ["updated_at", "2020-06-05 04:21:18.251543"]]

  def destroy
    book = Book.find(params[:book_id])
    #この場合booksのshowでbook_favorites_path(@book)というパス名でDELETEアクションが実行されている。それを実行すると、rails routesではfavorites#destroyが実行されるとなってる為、回ってきたIDをここで受け取っている。
    favorite = current_user.favorites.find_by(book_id: book.id)
    # ???何をいっているのか
    favorite.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 4], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 13]]