app/controllers/users_controller.rb

  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。
---
SELECT "users".* FROM "users"

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "fa"], ["profile_image_id", nil], ["updated_at", "2020-06-04 01:11:53.297413"], ["id", 3]]